### [DataFrame의 인덱스 다루기 - 2]
- 새로운 행인덱스 생성 및 적용 
- 메서드 : 변수명.reindex()

In [5]:
import pandas as pd

In [6]:
grade={'name':['마징가','태권V','원더우먼'],
       'kor':[90,80,70],
       'eng':[88,99,77],
       'eng':[75,85,95],
       'math':[91,71,81]}
gradeDF=pd.DataFrame(grade)
gradeDF

   name  kor  eng  math
0   마징가   90   75    91
1   태권V   80   85    71
2  원더우먼   70   95    81

In [7]:
# 행 인덱스를 세롭게 생성
new_index=[0,1,2,'r0','r1','r2']
DF2=gradeDF.reindex(new_index)
DF2

    name   kor   eng  math
0    마징가  90.0  75.0  91.0
1    태권V  80.0  85.0  71.0
2   원더우먼  70.0  95.0  81.0
r0   NaN   NaN   NaN   NaN
r1   NaN   NaN   NaN   NaN
r2   NaN   NaN   NaN   NaN

In [10]:
# 행 생성후 존제하지 않는 행에 값 설정
DF3=gradeDF.reindex([0,'r0','r1',2],fill_value=0)
DF3

    name  kor  eng  math
0    마징가   90   75    91
r0     0    0    0     0
r1     0    0    0     0
2   원더우먼   70   95    81